tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Monitor data's progress through a pipe
brew "pv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# A Zsh theme
brew "romkatv/powerlevel10k/powerlevel10k"

cask "1password"  # more flexible than MAS version
cask "alfred"     # direct license, MAS wildly out of date
cask "bartender"  # direct license
cask "daisydisk"  # direct license
cask "firefox"
cask "font-fontawesome"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "istat-menus"  # direct license
cask "iterm2"
cask "little-snitch"
cask "maestral"     # Open-source Dropbox client
cask "mx-power-gadget"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle"
cask "suspicious-package"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"

mas "1Password for Safari", id: 1569813296
mas "Internet Access Policy Viewer", id: 1482630322
mas "Notchmeister", id: 1599169747
mas "PCalc", id: 403504866
mas "Super Agent", id: 1568262835
mas "Unclutter", id: 577085396
mas "WireGuard", id: 1451685025

# Microsoft Office Suite
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
# iWork Suite
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
