tap "caarlos0/tap"
tap "domt4/autoupdate"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr", link: false
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Like gofmt, but for JSON files
brew "caarlos0/tap/jsonfmt"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"

cask "1password"  # more flexible than MAS version
cask "alfred"  # MAS wildly out of date
cask "atom"
cask "bartender"
cask "bettertouchtool"
cask "daisydisk"  # direct license
cask "discord"
# cask "docker"
cask "firefox"
cask "font-fontawesome"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
# cask "inkscape"
cask "intel-power-gadget"
cask "istat-menus"  # direct license
cask "iterm2"
cask "little-snitch"
cask "logitech-options"
# cask "plex"
# cask "plex-media-server"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
# cask "spotify"
cask "subtitles"
cask "suspicious-package"
cask "transmission"
# cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "wireshark"

mas "AdGuard for Safari", id: 1440147259
mas "GoodNotes", id: 1444383602
mas "Internet Access Policy Viewer", id: 1482630322
mas "Messenger", id: 1480068668
mas "PCalc", id: 403504866
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Unclutter", id: 577085396
# mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835

# Microsoft Office Suite
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
# iWork Suite
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
